$ ls ~/.vscode/extensions/ | sed 's/-[^-]*$//' | sort -u -t. -k2
rogalmic.bash-debug
bungcip.better-toml
shan.code-settings-sync
serayuzgur.crates
webfreak.debug
redhat.fabric8-analytics
codezombiech.gitignore
eamodio.gitlens
golang.go
wengerk.highlight-bad-chars
ybaumes.highlight-trailing-white-spaces
ephoton.indent-switcher
kaiwood.indentation-level-movement
redhat.java
dgileadi.java-decompiler
ms-toolsai.jupyter
ms-toolsai.jupyter-keymap
ipedrazas.kubernetes-snippets
yzhang.markdown-all-in-one
puppet.puppet-vscode
ms-python.python
lextudio.restructuredtext
rust-lang.rust
timonwong.shellcheck
coolbear.systemd-unit-file
hashicorp.terraform
be5invis.toml
dunstontc.viml
shengchen.vscode-checkstyle
redhat.vscode-commons
ms-azuretools.vscode-docker
knisterpeter.vscode-github
vscjava.vscode-java-debug
vscjava.vscode-java-dependency
vscjava.vscode-java-test
vadimcn.vscode-lldb
davidanson.vscode-markdownlint
vscjava.vscode-maven
ms-python.vscode-pylance
redhat.vscode-yaml
