# to get the list:
# cat ~/.vscode/extensions/extensions.json | jq -r '.[].identifier.id' | \
#     sort -t. -k2 -u

# to install:
# for i in $(grep -v '^#' extensions.txt | grep -v '^$'); do
#     code --install-extension $i
# done

# if vscode-bazel complains about buildifier:
# go install github.com/bazelbuild/buildtools/buildifier@latest

rogalmic.bash-debug
webfreak.debug
ms-python.debugpy
fill-labs.dependi
editorconfig.editorconfig
tamasfe.even-better-toml
redhat.fabric8-analytics
ms-python.flake8
codezombiech.gitignore
eamodio.gitlens
golang.go
wengerk.highlight-bad-chars
ybaumes.highlight-trailing-white-spaces
ephoton.indent-switcher
kaiwood.indentation-level-movement
visualstudioexptteam.intellicode-api-usage-examples
redhat.java
dgileadi.java-decompiler
ms-toolsai.jupyter
ms-toolsai.jupyter-keymap
ms-toolsai.jupyter-renderers
ipedrazas.kubernetes-snippets
ms-vscode.makefile-tools
yzhang.markdown-all-in-one
ms-python.mypy-type-checker
esbenp.prettier-vscode
puppet.puppet-vscode
ms-python.python
ms-vscode-remote.remote-containers
lextudio.restructuredtext
rust-lang.rust-analyzer
timonwong.shellcheck
trond-snekvik.simple-rst
coolbear.systemd-unit-file
hashicorp.terraform
be5invis.toml
dunstontc.viml
bazelbuild.vscode-bazel
shengchen.vscode-checkstyle
redhat.vscode-commons
ms-azuretools.vscode-docker
vscjava.vscode-gradle
vscjava.vscode-java-debug
vscjava.vscode-java-dependency
vscjava.vscode-java-pack
vscjava.vscode-java-test
ms-toolsai.vscode-jupyter-cell-tags
ms-toolsai.vscode-jupyter-slideshow
vadimcn.vscode-lldb
davidanson.vscode-markdownlint
vscjava.vscode-maven
42crunch.vscode-openapi
pbkit.vscode-pbkit
ms-python.vscode-pylance
redhat.vscode-yaml
visualstudioexptteam.vscodeintellicode
ms-vsliveshare.vsliveshare
