$ ls ~/.vscode/extensions/ | sed 's/-[^-]*$//' | sort -u -t. -k2
rogalmic.bash-debug
bungcip.better-toml
serayuzgur.crates
webfreak.debug
redhat.fabric8-analytics
codezombiech.gitignore
eamodio.gitlens
golang.go
wengerk.highlight-bad-chars
ybaumes.highlight-trailing-white-spaces
ephoton.indent-switcher
kaiwood.indentation-level-movement
visualstudioexptteam.intellicode-api-usage-examples
redhat.java-1.12.0-darwin
dgileadi.java-decompiler
ms-toolsai.jupyter
ms-toolsai.jupyter-keymap
ms-toolsai.jupyter-renderers
ipedrazas.kubernetes-snippets
ms-vscode.makefile-tools
yzhang.markdown-all-in-one
esbenp.prettier-vscode
puppet.puppet-vscode
ms-python.python
lextudio.restructuredtext
rust-lang.rust-analyzer-0.3.1266-darwin
timonwong.shellcheck
trond-snekvik.simple-rst
coolbear.systemd-unit-file
hashicorp.terraform-2.24.3-darwin
be5invis.toml
dunstontc.viml
shengchen.vscode-checkstyle
redhat.vscode-commons
ms-azuretools.vscode-docker
vscjava.vscode-java-debug
vscjava.vscode-java-dependency
vscjava.vscode-java-pack
vscjava.vscode-java-test
ms-toolsai.vscode-jupyter-cell-tags
ms-toolsai.vscode-jupyter-slideshow
vadimcn.vscode-lldb
davidanson.vscode-markdownlint
vscjava.vscode-maven
github.vscode-pull-request-github
ms-python.vscode-pylance
redhat.vscode-yaml
visualstudioexptteam.vscodeintellicode
ms-vsliveshare.vsliveshare
